In [153]:
import numpy as np
import pandas as pd

In [154]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [155]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [156]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [157]:
pd.Series(data=d)

a    10
b    20
c    30
dtype: int64

In [158]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [159]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [160]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [161]:
i = ['USA','Germany','USSR','Japan']
w = [1,2,3,4]

ser1 = pd.Series(w,i)
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [162]:
ser1 = pd.Series([1,2,3,4], index = ['USA','Germany','USSR','Japan'])

In [163]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [164]:
ser1[0]

1

In [165]:
ser1['USA']

1

In [166]:
from numpy.random import randn
np.random.seed(5)

In [167]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

In [168]:
df['W']

A    0.441227
B    0.109610
C    0.187603
D   -0.358829
E    1.151391
Name: W, dtype: float64

In [169]:
df = pd.DataFrame(randn(5,1),index='A B C D E'.split(),columns='W'.split())
df
# DataFrame의 column 불러오기 연습

          W
A -0.980608
B -0.856853
C -0.871879
D -0.422508
E  0.996440

In [170]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.712421  0.059144 -0.363311  0.003289
B -0.105930  0.793053 -0.631572 -0.006195
C -0.101068 -0.052308  0.249218  0.197660
D  1.334849 -0.086876  1.561532 -0.305853
E -0.477731  0.100738  0.355438  0.269612

In [171]:
df[['W','Z']]
# 대괄후 2개쓰면 테이블 형태라 그대로 나옴

          W         Z
A  0.712421  0.003289
B -0.105930 -0.006195
C -0.101068  0.197660
D  1.334849 -0.305853
E -0.477731  0.269612

In [172]:
df = pd.DataFrame(randn(5,5),index='A B C D E'.split(),columns='W X Y Z new'.split())
df

          W         X         Y         Z       new
A  1.291963  1.139343  0.494440 -0.336336 -0.100614
B  1.413398  0.221254 -1.310773 -0.689565 -0.577513
C  1.152205 -0.107164  2.260107  0.656619  0.124807
D -0.435704  0.972179 -0.240711 -0.824123  0.568133
E  0.012758  1.189061 -0.073593 -2.859688  0.789366

In [173]:
df['new']=df['W']+df['Y']

In [174]:
df

          W         X         Y         Z       new
A  1.291963  1.139343  0.494440 -0.336336  1.786404
B  1.413398  0.221254 -1.310773 -0.689565  0.102625
C  1.152205 -0.107164  2.260107  0.656619  3.412312
D -0.435704  0.972179 -0.240711 -0.824123 -0.676415
E  0.012758  1.189061 -0.073593 -2.859688 -0.060835

In [175]:
df.drop('new',axis=1)
# new라는 컬럼을 삭제

          W         X         Y         Z
A  1.291963  1.139343  0.494440 -0.336336
B  1.413398  0.221254 -1.310773 -0.689565
C  1.152205 -0.107164  2.260107  0.656619
D -0.435704  0.972179 -0.240711 -0.824123
E  0.012758  1.189061 -0.073593 -2.859688

In [176]:
df.drop('E')

          W         X         Y         Z       new
A  1.291963  1.139343  0.494440 -0.336336  1.786404
B  1.413398  0.221254 -1.310773 -0.689565  0.102625
C  1.152205 -0.107164  2.260107  0.656619  3.412312
D -0.435704  0.972179 -0.240711 -0.824123 -0.676415

In [177]:
df.drop('E',axis=0)
# Tuple형태, 
# 앞에 5는 row 수, 해당 인덱스는 0
# 뒤에 4는 column수, 해당 인덱스는 1 
# axis는 축이라는 뜻

          W         X         Y         Z       new
A  1.291963  1.139343  0.494440 -0.336336  1.786404
B  1.413398  0.221254 -1.310773 -0.689565  0.102625
C  1.152205 -0.107164  2.260107  0.656619  3.412312
D -0.435704  0.972179 -0.240711 -0.824123 -0.676415

In [178]:
df.loc[['A']]

          W         X        Y         Z       new
A  1.291963  1.139343  0.49444 -0.336336  1.786404

In [179]:
df.loc['A']

W      1.291963
X      1.139343
Y      0.494440
Z     -0.336336
new    1.786404
Name: A, dtype: float64

In [180]:
df.iloc[2]

W      1.152205
X     -0.107164
Y      2.260107
Z      0.656619
new    3.412312
Name: C, dtype: float64

In [181]:
df.loc['B'].iloc[2]

-1.3107731333797457

In [182]:
df.loc['B','Y']

-1.3107731333797457

In [183]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  1.291963  0.494440
B  1.413398 -1.310773

Dataframe의  conditional selection(조건부 선택)

In [191]:
df[df['W']>0]
# W 열중에서 - 행을 지운다

          W         X         Y         Z       new
A  1.291963  1.139343  0.494440 -0.336336  1.786404
B  1.413398  0.221254 -1.310773 -0.689565  0.102625
C  1.152205 -0.107164  2.260107  0.656619  3.412312
E  0.012758  1.189061 -0.073593 -2.859688 -0.060835

In [192]:
df[df['W']>0][['X','Y']]

          X         Y
A  1.139343  0.494440
B  0.221254 -1.310773
C -0.107164  2.260107
E  1.189061 -0.073593

In [193]:
df[df['W']>0]['Y']

A    0.494440
B   -1.310773
C    2.260107
E   -0.073593
Name: Y, dtype: float64

In [204]:
df[df['W']>1][df['Y']>1]

C:\Users\EduwillSN\AppData\Local\Temp\ipykernel_5344\2868911474.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df['W']>1][df['Y']>1]

          W         X         Y         Z       new
C  1.152205 -0.107164  2.260107  0.656619  3.412312

In [208]:
# 컬럼w에 음수가 있을경우 row를 빼고 컬럼Y에 벨류가 1보다 큰값들만 출력
df[df['W']>1]
df[df['Y']>1]

          W         X         Y         Z       new
C  1.152205 -0.107164  2.260107  0.656619  3.412312

In [211]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z       new
C  1.152205 -0.107164  2.260107  0.656619  3.412312